{"title": "3 bedroom detached house for sale", "price": 275000, "price_text": "£275,000", "address": "Tower Close, Trowbridge", "description": "A wonderful opportunity to purchase a detached family house in a pleasant cul de sac off of Wingfield Road. Close to a selection of schools, this well presented property backs on to the local playing field. Externally there is driveway parking leading to the garage and a west facing garden to the...", "link": "https://www.rightmove.co.uk/properties/150062429#/?channel=RES_BUY"}
{"title": "2 bedroom detached house for sale", "price": 295000, "price_text": "£295,000", "address": "Oxford Road, Calne", "description": "CHAIN FREE! This imposing detached house, rich in period features, is conveniently located near town centre amenities. The property has been meticulously updated throughout, blending modern comforts with its historical charm. Inside, it boasts two spacious reception rooms perfect for entertaining...", "link": "https://www.rightmove.co.uk/properties/150695114#/?channel=RES_BUY"}
{"title": "2 bedroom detached house for sale", "price": 250000, "price_text": "£250,000", "address": "King Street, Melksham, Wiltshire, SN12", "description": "NO ONWARD CHAIN - Located within a short walk of Melksham Town Centre and all of its local amenities, this detached, two-bedroom period home has been recently renovated and modernised both inside and out and is ready for its next prospective buyer to move straight in and add their own stamp an...", "link": "https://www.rightmove.co.uk/properties/148405328#/?channel=RES_BUY"}
{"title": "2 bedroom detached house for sale", "price": 295000, "price_text": "£295,000", "address": "Hazel Grove, Westfield, Radstock", "description": "Welcome to this delightful DETACHED house located in Westfield. This stunning property boasts TWO DOUBLE BEDROOMS, making it perfect for a small family or those looking for a cosy space to call home. The interior of the house is thoughtfully designed, with a warm and inviting atmosphere that welc...", "link": "https://www.rightmove.co.uk/properties/150604646#/?channel=RES_BUY"}
{"title": "3 bedroom link detached house for sale", "price": 290000, "price_text": "£290,000", "address": "Tyning Park, Calne", "description": "CHAIN FREE! A delightful three bedroom link detached house featuring a pretty rear garden over looking a wooded copse. The property is situated on the South side of the town and is within walking distance to local schooling in the area. The property is well proportioned and includes an entrance h...", "link": "https://www.rightmove.co.uk/properties/147736190#/?channel=RES_BUY"}
{"title": "3 bedroom cottage for sale", "price": 230000, "price_text": "£230,000", "address": "Main Road, Woodford, GL13", "description": "Perfect for those looking for a character family home with private garden, and investors looking for plenty of opportunity to extend and add value. Being Sold via Secure sale online Bidding. Terms & Conditions Apply. Starting Bid £230,000", "link": "https://www.rightmove.co.uk/properties/149509904#/?channel=RES_BUY"}
{"title": "3 bedroom cottage for sale", "price": 230000, "price_text": "£230,000", "address": "Main Road, Woodford, Berkeley, Gloucestershire, GL13 9JN", "description": "Interior As you approach the double-fronted exterior, you are greeted by an inviting entrance hall that sets the tone for the home's period charm. The dining room exudes warmth and character, featuring deep skirting boards and picture rails that accentuate the space's historical eleganc...", "link": "https://www.rightmove.co.uk/properties/86903979#/?channel=RES_BUY"}
{"title": "2 bedroom detached house for sale", "price": 215000, "price_text": "£215,000", "address": "Elm Tree Park, Sheepway, Portbury, Bristol, BS20", "description": "Sold with no onward chain & partly furnished. Reeds Rains are delighted to present this wonderful park home. The home has fantastic accommodation with a stylish, fully-equipped kitchen, which comes with a built-in stove, seamlessly transitioning into the spacious dining room, promising countl...", "link": "https://www.rightmove.co.uk/properties/146657132#/?channel=RES_BUY"}
{"title": "2 bedroom cottage for sale", "price": 225000, "price_text": "£225,000", "address": "Boreham Road, Warminster", "description": "*Watch the video tour* This delightful period cottage features two bedrooms and is conveniently positioned close to local amenities. Additionally, it is being presented to the market with the added bonus of no onward chain.", "link": "https://www.rightmove.co.uk/properties/148968938#/?channel=RES_BUY"}
{"title": "3 bedroom detached house for sale", "price": 299950, "price_text": "£299,950", "address": "Hamlyn Road, Glastonbury", "description": "Affording an elevated location with wonderful far reaching views across the town to the levels in the west. This three bed detached house is conveniently situated within five minutes walk of the High Street and does requiring some updating. It also benefits from a sitting room, kitchen/dining roo...", "link": "https://www.rightmove.co.uk/properties/145511867#/?channel=RES_BUY"}
{"title": "3 bedroom detached house for sale", "price": 295000, "price_text": "£295,000", "address": "Caddy Lane, Mere", "description": "Offered to the market with no onward chain is this beautifully presented, link detached three-bedroom home with parking and a garage. This desirable Wiltshire town boasts a thriving community and caters well for everyday need. There is a Co-op store, post office, greengrocers and chemist, as wel...", "link": "https://www.rightmove.co.uk/properties/149886527#/?channel=RES_BUY"}
{"title": "3 bedroom detached house for sale", "price": 300000, "price_text": "£300,000", "address": "Park Road - Bowerhill, Melksham, SN12", "description": "GUIDE PRICE £300,000 -£325,00\nFabulous position overlooking a pleasant open green space. Attractive landscaped rear garden plus garage and driveway. Three bedrooms, two bath/shower rooms, and a large open plan kitchen/diner. Approached at the front, the property stands slightly elevated, and has...", "link": "https://www.rightmove.co.uk/properties/146027084#/?channel=RES_BUY"}
{"title": "3 bedroom detached house for sale", "price": 300000, "price_text": "£300,000", "address": "Ratcliffe Drive, Stoke Gifford, Bristol", "description": "Spacious three bedroom detached house, offered to the market with no onward chain. Situated within the popular location of Stoke Gifford, with easy access to St. Michael's Primary School, Parkway Train Station. Includes garage and parking. Call for further details.", "link": "https://www.rightmove.co.uk/properties/150199613#/?channel=RES_BUY"}
{"title": "3 bedroom cottage for sale", "price": 275000, "price_text": "£275,000", "address": "The Butts, Bratton", "description": "This period three bedroom cottage is situated in the heart of the desirable village of Bratton. The property offers a lovely aspect overlooking an open park area, providing the perfect setting for families looking for outdoor space without the hassle of maintaining a garden. Features include a lo...", "link": "https://www.rightmove.co.uk/properties/149663231#/?channel=RES_BUY"}
{"title": "2 bedroom cottage for sale", "price": 265000, "price_text": "£265,000", "address": "Jubilee Road, Axbridge, BS26", "description": "A beautifully decorated, upgraded and presented two bedroom extended cottage with south facing courtyard garden, no onward chain and situated in the historic medieval town of Axbridge close to local amenities.", "link": "https://www.rightmove.co.uk/properties/149370983#/?channel=RES_BUY"}
{"title": "2 bedroom detached house for sale", "price": 300000, "price_text": "£300,000", "address": "Poets Close, Bristol, BS5", "description": "Yopa are pleased to present this two bedroom energy efficient (EPC of C) detached home located in a quiet cul-de-sac in the heart of Whitehall. This property would be fantastic for first time buyers or an investor. It's been well looked after by its current owner and now awaits its new owners!", "link": "https://www.rightmove.co.uk/properties/150458057#/?channel=RES_BUY"}
{"title": "3 bedroom detached house for sale", "price": 300000, "price_text": "£300,000", "address": "Hill Street, Kingswood, Bristol, BS15", "description": "Offering generous living space with a new kitchen and shower suite installed in 2022 and having the added bonus of a boarded loft with potential to make into a further bedroom subject to planning.", "link": "https://www.rightmove.co.uk/properties/150455831#/?channel=RES_BUY"}
{"title": "3 bedroom detached house for sale", "price": 280000, "price_text": "£280,000", "address": "Crocker Way, Wincanton", "description": "A fantastic opportunity to purchase this 3 bedroom detached house with no onward chain. It offers a lounge, kitchen, utility room, 3 bedrooms, where the master bedroom has an ensuite, and a bathroom. The rear garden is patio with steps to a raised lawn area. MORE PHOTOS TO FOLLOW!", "link": "https://www.rightmove.co.uk/properties/150391760#/?channel=RES_BUY"}
{"title": "3 bedroom detached house for sale", "price": 300000, "price_text": "£300,000", "address": "Shepherds Mead, Dilton Marsh", "description": "*Watch the video tour* A three-bedroom detached home set in a village location and comes to the market with the added benefit of no onward chain.", "link": "https://www.rightmove.co.uk/properties/150341174#/?channel=RES_BUY"}
{"title": "3 bedroom detached house for sale", "price": 300000, "price_text": "£300,000", "address": "Emborough, Radstock, Somerset, BA3", "description": "This 1458 sq ft home is set in a development of just 30 residential Park Homes in the hamlet of Emborough, featured around a parkland style area with mature trees and is conveniently positioned for access to the A37 to both Bath and Bristol with local amenities available in the nearby Mendip vill...", "link": "https://www.rightmove.co.uk/properties/146582273#/?channel=RES_BUY"}
{"title": "3 bedroom detached house for sale", "price": 279000, "price_text": "£279,000", "address": "Actis Road, Glastonbury, Somerset, BA6", "description": "A three bedroom detached house situated on the ever-popular Redlands development. Benefitting from an enclosed rear garden, garage and off-road parking, the property is available to purchase with no onward chain. EPC rating B.", "link": "https://www.rightmove.co.uk/properties/150224090#/?channel=RES_BUY"}
{"title": "2 bedroom cottage for sale", "price": 294000, "price_text": "£294,000", "address": "Priory Street, Corsham", "description": "Set in a FANTASTIC LOCATION in CORSHAM, close to local amenities, this delightful two bedroom COTTAGE has some lovely PERIOD FEATURES and is full of character, offering well presented living space and a fully enclosed rear garden. NO ONWARD CHAIN", "link": "https://www.rightmove.co.uk/properties/144810089#/?channel=RES_BUY"}
{"title": "3 bedroom detached house for sale", "price": 299995, "price_text": "£299,995", "address": "Harvard Close, Bowerhill, Melksham", "description": "Being sold for the first time since new, we are pleased to bring to the market this attractive 3 bedroom detached home in a quiet corner of Bowerhill. The property includes entrance porch with cloakroom, reception/dining room, lounge and kitchen. The garage has been converted into a laundry room ...", "link": "https://www.rightmove.co.uk/properties/144712385#/?channel=RES_BUY"}
{"title": "3 bedroom detached house for sale", "price": 280000, "price_text": "£280,000", "address": "Chalice Park, Glastonbury, BA6", "description": "Situated within a secluded cul-de-sac, within easy walking distance of the Town Centre, this detached family home benefits from three bedrooms, en-suite facilities, garden and off road parking.", "link": "https://www.rightmove.co.uk/properties/139938965#/?channel=RES_BUY"}
{"title": "3 bedroom detached house for sale", "price": 280000, "price_text": "£280,000", "address": "Twenty Acres Road, Bristol", "description": "A HIDDEN GEM!This substantial well maintained three bedroom DETACHED family home offers a charming 32 FT X 20 FT ENCLOSED REAR GARDEN, 17 ft lounge, 12 ft kitchen, hall with study area, downstairs cloakroom and bathroom. NO ONWARD CHAIN.", "link": "https://www.rightmove.co.uk/properties/149168264#/?channel=RES_BUY"}

